'''
語法
S = Q? NP* v? V v? NP* .
NP = (D d)? N

範例：
  小明 有 5 個 蘋果 ， 
  給 了 小華 3 個 蘋果 ， 
  請問 他 還 剩 幾 個 蘋果 ？
'''

tagMap={
  'N' : ["小明", "小華", "小莉", "大雄", 
       "他", "你", "我", 
       "蘋果", "橘子", "柳丁", "番茄"],
  'V' : ["有", "給", "剩"],
  'v' : ["還", "又", "了"],
  'D' : ["幾", "這", "那", "5", "3"],
  'd' : ["個", "隻", "條"],
  'Q' : ["請問"],
  '.' : ["，", "？", "。"]
}

mtMap = {
  "小明":"ShaoMin", "小華":"ShaoHua", "小莉":"ShaoLi", "大雄":"DaShon", 
  "他":"he", "你":"you", "我":"me", 
  "蘋果":"apple", "橘子":"tangerine", "柳丁":"orange", "番茄":"tomato",
  "有":"have", "給":"give", "剩":"own",
  "還":"still", "又":"and", "了":"_",
  "個":"_", "隻":"_", "條":"_",
  "幾":"n?", "這":"this", "那":"that", 
  "請問":"Q", "？":"_."
}
