# 參考 https://statistics-using-python.blogspot.com/2019/08/one-way-analysis-of-variancesone-way.html

# 6. 檢查資料是否為常態分布 (H0:資料為常態分佈):
dat1 = [61.8,65.1,61.7,63.3]
dat2 = [78.8,79.5,76.0,73.4,77.3]
dat3 = [70.5,72.6,71.7,72.0,71.1]
# dat4 = [60.3,63.8,64.1,61.4,60.9] #  pvalue=0.23815500736236572 不能拒絕
dat4 = [1, 1, 1, 1, 5, 2, 4, 8, 9, 9, 9, 9] # pvalue=0.007195335812866688 可以拒絕
import scipy.stats
print(scipy.stats.shapiro(dat1))
# 結果: (0.8768853545188904, 0.32550376653671265)
# p = 0.3255 > 0.05，接受H0:資料為常態分佈。
print(scipy.stats.shapiro(dat2))
# 結果: (0.9504634737968445, 0.7404994964599609)
# p = 0.7405 > 0.05，接受H0:資料為常態分佈。
print(scipy.stats.shapiro(dat3))
# 結果: (0.9899775981903076, 0.9796159863471985)
# p = 0.9796 > 0.05，接受H0:資料為常態分佈。
print(scipy.stats.shapiro(dat4))
# 結果: (0.8627133369445801, 0.23815500736236572)
# p = 0.2381 > 0.05，接受H0:資料為常態分佈。
